app/Controllers/Admin/Anggota.php

    public function index()
    {
        $model = new AnggotaModel();
        $keyword = $this->request->getGet('keyword') ?? '';
        // Ambil nilai per_page dari URL, defaultnya 5
        $perPage = $this->request->getGet('per_page') ?? 5;

        $query = $model->orderBy('nama', 'ASC');
        if ($keyword) {
            $query->like('nama', $keyword)->orLike('nim', $keyword);
        }

        $data = [
            'title' => 'Kelola Anggota',
            'anggota' => $query->paginate($perPage, 'anggota'),
---
SELECT *
FROM `anggota`
ORDER BY `nama` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `anggota`