app/Controllers/Admin/Book.php

    public function index()
    {
        $model = new BookModel();
        $keyword = $this->request->getGet('keyword') ?? '';
        $perPage = $this->request->getGet('per_page') ?? 5;

        $query = $model->orderBy('judul', 'ASC');
        if ($keyword) {
            $query->like('judul', $keyword)->orLike('penulis', $keyword);
        }

        $data = [
            'title' => 'Manajemen Buku',
            'books' => $query->paginate($perPage, 'buku'), // Koma ditambahkan di sini
---
SELECT *
FROM `books`
ORDER BY `judul` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `books`