app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Query untuk buku paling populer (paling sering dipinjam)
        $topBorrowedQuery = $db->table('peminjaman p')
                               ->select('b.judul, COUNT(p.book_id) as total_pinjam')
                               ->join('books b', 'b.id = p.book_id')
                               ->groupBy('p.book_id')
                               ->orderBy('total_pinjam', 'DESC')
                               ->limit(5)
                               ->get();

        $data = [
            'title' => 'Dashboard',
            'total_books' => (new BookModel())->countAllResults(),
            'total_anggota' => (new AnggotaModel())->countAllResults(),
            'sirkulasi_aktif' => (new PeminjamanModel())->where('status', 'dipinjam')->countAllResults(),
            'laporan_sirkulasi' => (new PeminjamanModel())->where('tanggal_kembali', null)->where('DATEDIFF(NOW(), tanggal_harus_kembali) >', 0)->countAllResults(),
            'top_borrowed_books' => $topBorrowedQuery->getResultArray(),
            'newest_books' => (new BookModel())->orderBy('created_at', 'DESC')->limit(5)->find()
---
SELECT `b`.`judul`, COUNT(p.book_id) as total_pinjam
FROM `peminjaman` `p`
JOIN `books` `b` ON `b`.`id` = `p`.`book_id`
GROUP BY `p`.`book_id`
ORDER BY `total_pinjam` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `books`
SELECT COUNT(*) AS `numrows`
FROM `anggota`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `tanggal_kembali` IS NULL
AND DATEDIFF(NOW(), tanggal_harus_kembali) > 0
SELECT *
FROM `books`
ORDER BY `created_at` DESC
 LIMIT 5