app/Controllers/Admin/Pengguna.php

SELECT *
FROM `users`
---
    public function index()
    {
        $model = new UserModel();
        $data = [
            'title' => 'Pengguna Sistem',
            'users' => $model->findAll()