app/Controllers/Admin/Sirkulasi.php

public function index()
{
    $db = \Config\Database::connect();
    $builder = $db->table('peminjaman p');
    $builder->select('p.id, b.judul, a.nama, p.tanggal_pinjam, p.tanggal_harus_kembali, p.status, DATEDIFF(NOW(), p.tanggal_harus_kembali) as terlambat');
    $builder->join('books b', 'b.id = p.book_id');
    $builder->join('anggota a', 'a.id = p.anggota_id');
    $builder->orderBy('p.status', 'ASC')->orderBy('p.tanggal_pinjam', 'DESC'); // Urutkan berdasarkan status
    $query = $builder->get();
---
SELECT `p`.`id`, `b`.`judul`, `a`.`nama`, `p`.`tanggal_pinjam`, `p`.`tanggal_harus_kembali`, `p`.`status`, DATEDIFF(NOW(), p.tanggal_harus_kembali) as terlambat
FROM `peminjaman` `p`
JOIN `books` `b` ON `b`.`id` = `p`.`book_id`
JOIN `anggota` `a` ON `a`.`id` = `p`.`anggota_id`
ORDER BY `p`.`status` ASC, `p`.`tanggal_pinjam` DESC